<!-- placeholder-1 -->
```fish
terraform plan
```
<!-- placeholder-2 -->

<details><summary>Diff of 4 changes.</summary>

```diff
~ data.cloudinit_config.api will be read during apply
# (depends on a resource or a module with changes pending)
! aws_autoscaling_group.api will be updated in-place
! aws_instance.db will be updated in-place
! aws_launch_template.api will be updated in-place
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 0 to add, 3 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @kohanyirobert at 2024-11-22T15:03:06Z [(view log)](https://github.com/kohanyirobert/example-infra/actions/runs/11975038138/job/33387486927#step:4:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudinit_config.api will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "api" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                dnf update -y
                dnf install -y docker
                systemctl enable --now docker
                usermod -aG docker ec2-user
                newgrp docker
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "00-install-docker.sh"
        }
      + part {
          + content      = <<-EOT
                #!/bin/bash
                db_password=$(aws ssm get-parameter --output text --query Parameter.Value --name db_password)
                image=ghcr.io/kohanyirobert/example-api:latest
                docker pull $image
                docker run \
                  --name api \
                  --publish 80:5000 \
                  --env PG_URL=postgres://api:$db_password@10.0.10.225:5432/cars \
                  --rm \
                  --detach \
                  $image
                
                until curl --fail http://localhost/api/cars
                do
                  echo "Waiting for the api, retrying in 3 seconds..."
                  sleep 3
                done
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "01-deploy-api.sh"
        }
    }

  # aws_autoscaling_group.api will be updated in-place
  ~ resource "aws_autoscaling_group" "api" {
        id                               = "api-asg-2024112209294170320000000a"
        name                             = "api-asg-2024112209294170320000000a"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-021a88aa9519cf053"
            name    = "api-template"
          ~ version = "3" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_instance.db will be updated in-place
  ~ resource "aws_instance" "db" {
        id                                   = "i-072e993d7d87f56ff"
      ~ tags                                 = {
            "Name"    = "main-db"
            "Project" = "main"
          - "Status"  = "Ready" -> null
        }
      ~ tags_all                             = {
          - "Status"  = "Ready" -> null
            # (2 unchanged elements hidden)
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_launch_template.api will be updated in-place
  ~ resource "aws_launch_template" "api" {
        id                                   = "lt-021a88aa9519cf053"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "api-template"
        tags                                 = {
            "Name"    = "main-api-template"
            "Project" = "main"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0iMDAtaW5zdGFsbC1kb2NrZXIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZG5mIHVwZGF0ZSAteQpkbmYgaW5zdGFsbCAteSBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBkb2NrZXIKdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm5ld2dycCBkb2NrZXIKDQotLU1JTUVCT1VOREFSWQ0KQ29udGVudC1EaXNwb3NpdGlvbjogYXR0YWNobWVudDsgZmlsZW5hbWU9IjAxLWRlcGxveS1hcGkuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZGJfcGFzc3dvcmQ9JChhd3Mgc3NtIGdldC1wYXJhbWV0ZXIgLS1vdXRwdXQgdGV4dCAtLXF1ZXJ5IFBhcmFtZXRlci5WYWx1ZSAtLW5hbWUgZGJfcGFzc3dvcmQpCmltYWdlPWdoY3IuaW8va29oYW55aXJvYmVydC9leGFtcGxlLWFwaTpsYXRlc3QKZG9ja2VyIHB1bGwgJGltYWdlCmRvY2tlciBydW4gXAogIC0tbmFtZSBhcGkgXAogIC0tcHVibGlzaCA4MDo1MDAwIFwKICAtLWVudiBQR19VUkw9cG9zdGdyZXM6Ly9hcGk6JGRiX3Bhc3N3b3JkQDEwLjAuMTAuMjI1OjU0MzIvY2FycyBcCiAgLS1ybSBcCiAgLS1kZXRhY2ggXAogICRpbWFnZQoKdW50aWwgY3VybCAtLWZhaWwgaHR0cDovL2xvY2FsaG9zdC9hcGkvY2FycwpkbwogIGVjaG8gIldhaXRpbmcgZm9yIHRoZSBhcGksIHJldHJ5aW5nIGluIDMgc2Vjb25kcy4uLiIKICBzbGVlcCAzCmRvbmUKDQotLU1JTUVCT1VOREFSWS0tDQo=" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-3-a9422b584118f6d71f77b7807de4e5ad.tfplan -->
<!-- placeholder-6 -->